import React from 'react'
import {Grid, Typography} from "@mui/material";
import useMediaQuery from "@mui/material/useMediaQuery";
import {useTheme} from "@mui/material/styles";

const ServicesAltynRail = ({image, title, dec, titleItem, items, imageMin}) => {

    // fixme title : string , dec:string , titleItem: string  , items:[]

    const theme = useTheme()

    const isXs = useMediaQuery(theme.breakpoints.down('xs'));
    const isMd = useMediaQuery(theme.breakpoints.up('md'));


    let variant = 'subtitle1';

    let variantSecond = 'subtitle2';

    if (isXs) {
        variant = 'subtitle1';
        variantSecond = 'subtitle2'
    } else if (isMd) {
        variant = 'h2';
        variantSecond = 'subtitle1'
    }


    return (
        <Grid pt={{md: '89px'}}>
            <Grid position={'absolute'} top={{xs:'215%' , xxs:'195%' , s:'142%' , md:'120%' , lg:'90%'}} o right={0} zIndex={-1}>
                <img width={'100%'} src={'assets/images/back.svg'} alt={''}/>

            </Grid>
            <Grid display={'flex'} flexDirection={{xs: 'column', md: 'row-reverse'}}
                  alignItems={{xs: 'center', md: 'start'}}
                  gap={{xs: '0px', md: '25px'}}
                  justifyContent={{xs: 'center', md: 'space-between'}} pb={{xs: '', md: '96px'}}>
                <Grid>
                    <Typography pb={{xs: '8px', md: '16px'}} fontWeight={900} variant={variant}>{title}</Typography>
                    <Typography textAlign={'justify'} variant={'subtitle1'} fontWeight={500}
                                lineHeight={'25px'} pb={{xs: '41px', md: '0px'}}>

                        حمل و نقل ریلی یکی از روش های حمل و نقل زمینی است که برای جابجایی بار و مسافر از خطوط راه آهن، قطار و ایستگاه‌های قطار استفاده می‌کند. حمل و نقل ریلی (Railroad Transportation) را می‌توان قسمتی از زنجیره لجستیکی حمل و نقل بار در سطح بین المللی دانست که منجر به رشد اقتصادی و بالا رفتن میزان ترانزیت می‌گردد. یکی از اصلی‌ترین مزیت های حمل و نقل ریلی امکان حمل بارهای بسیار سنگین و فله توسط ناوگان ریلی است که از عهده وسایل نقلیه دیگر خارج است و يا صرفه اقتصادي در پي نخواهد . از دیگر مزایای این روش می توان به ایمنی بالا، امکان ارسال بار در وزن و حجم بالا، امکان ارسال بار در مقیاس طولانی و استفاده از این روش در حمل و نقل ترکیبی (جاده‌ای و دریایی) اشاره کرد. هر واگن قطار معادل تقریبا 2.5 کامیون محموله ظرفیت دارد. برای مثال فرض کنید یک کالا در یک کامیون 22 تنی یا 23 تنی قرار گیرد؛ حالا همان کالا میتواند در یک سوم یک واگن قطار قرار گیرد و هنوز فضا برای کالاهای دیگر باشد. بنابراين می‌توان گفت حمل و نقل ریلی از این جهت بسیار به سود صاحبان کالا است زیرا کالا با هزینه کمتری حمل می‌شود. در اینجا به برخی از مزایای حمل‌ونقل ریلی نسبت به سایر روش‌های حمل‌ونقل اشاره می‌شود:

                        <br />

                        نياز به سوخت کمتر: حمل‌ونقل ریلی در مقایسه با روش‌ حمل‌ونقل جاده‌ای نیاز به سوخت کمتری دارد. در نتیجه هزینه سوخت حمل‌ونقل ریلی نیز کمتر است (به خصوص برای حمل بار در حجم بالا).

                        <br />

                        آلودگی کمتر: قطارها در یک مسافت مشخص سوخت کمتری نسبت به کامیون‌ها می‌سوزانند، از این رو حمل‌ونقل از طریق قطار سازگارتر با محیط زیست است. طبق گزارش انجمن راه آهن آمریکا(AAR)، راه آهن‌های باری می‌توانند یک تن بار را با یک گالن سوخت به طور متوسط 770 كيلومتر جابجا کنند. علاوه بر این، استفاده از حمل‌ونقل ریلی نسبت به حمل‌ونقل جاده‌ای می‌تواند انتشار گازهای گلخانه‌ای را تا ۷۵ درصد کاهش دهد و از همین رو به حمل و نقل سبز نیز معروف است.

                        <br />


                        بزرگترین مزیت حمل‌ونقل ریلی این است که قابل اعتمادترین روش حمل‌ونقل است زیرا کمترین تأثیر را از شرایط آب و هوایی مانند باران، مه و غیره در مقایسه با سایر روش‌های حمل‌ونقل می‌پذیرد و همچنين راه آهن به عنوان امن‌ترین نوع حمل‌ونقل شناخته شده است زیرا احتمال تصادف و خرابی راه‌آهن در مقایسه با سایر روش‌های حمل‌ونقل کمتر است.

                        <br />

                        از معايب راه آهن مي‌توان به هزينه اوليه بالا جهت احداث مسير،‌عدم انعطاف پذيري به علت حركت محدود قطار و عدم وجود خدمات درب به درب بار مي‌باشد.


                    </Typography>


                    <Typography pb={{xs: '8px', md: '16px'}} fontWeight={900} variant={variant}>تاریخچه حمل و نقل ریلی در ایران
                    </Typography>
                    <Typography textAlign={'justify'} variant={'subtitle1'} fontWeight={500}
                                lineHeight={'25px'} pb={{xs: '41px', md: '0px'}}>
                        اگر از تاريخ پر فراز و نشيب راه آهن در زمان قاجار بگذريم، پس از تصویب لایحه احداث راه آهن در سال ۱۳۰۵در مجلس شوراي ملي در زمان پهلوي اول، سرانجام در ۲۳ مهر ماه سال ۱۳۰۶ شمسی پروژه احداث راه آهن سراسری ایران به دست رضا شاه کلنگ خورد. این مسیر یک خط آهن سراسری بود و از شمال شرقی به جنوب غربی ایران می رسید. در سال ۱۳۰۶ قرارداد نقشه‌برداری برای احداث خطوط راه‌آهن با کنسرسیومی متشکلی از کمپانی آمریکایی یولن و شرکت‌های آلمانی فیلیپ هولتسمان- ویولیوس برگر و زیمینس باواونیون به بهای هر کیلومتر حداکثر ۳۶۸ تومان بسته شد و در سال ۱۳۱۷ و پس از ۱۱ سال، سرانجام راه آهن سراسری ایران که از  بندرتركمن (بندرشاه سابق) در جنوب دریای خزر آغاز و به بندر امام خمینی در سواحل خلیج فارس می رسید افتتاح شد. به همت دفتر مهندسي و تاسيسات زيربنايي راه آهن ج.ا.ا در سال‌هاي اخير، راه آهن سراسری ایران به عنوان طولانی‌ترین خط ریلی جهان در فهرست یونسکو ثبت شده و لقب راه آهن شمال جنوب ایران را به خود اختصاص داده است. پل ورسک نیز به عنوان نماد راه آهن سراسری ایران محسوب می شود که آن هم ثبت ملی و جهانی شده است.
                    </Typography>



                    <Typography pb={{xs: '8px', md: '16px'}} fontWeight={900} variant={variant}>جایگاه ایران در حمل و نقل ریلی جهان
                    </Typography>
                    <Typography textAlign={'justify'} variant={'subtitle1'} fontWeight={500}
                                lineHeight={'25px'} pb={{xs: '41px', md: '0px'}}>
                        کشور‌های آمریکا، چین، روسیه، هند و کانادا طولانی ترین خطوط راه آهن جهان را در اختیار دارند. ایران نیز  از منظر زیر ساخت های ریلی در میان ۱۴۳ کشور جهان در جایگاه ۴۵ قرار گرفته است. تا پایان سال ۱401 ایران دارای 15037 کیلومتر شبکه ریلی راه آهن استاندارد و 100 کیلومتر خطوط آهن عریض در مسیر میرجاوه-زاهدان و خطوط ايستگاه‌هاي سرخس و اينچه برون است؛ که بالاتر از کشورهای ترکیه، عربستان، یونان، مکزیک و برزیل می باشد. علاوه بر این ایران از لحاظ سهم خطوط ریلی شهری و پروژه‌های در حال ساخت، رتبه هفتم جهان را به خود اختصاص داده است. کشورهای چین با ۲۱۰۰ کیلومتر، آمریکا با ۱۲۱۵ کیلومتر، آلمان با ۹۱۹ کیلومتر، ژاپن با ۷۹۴ کیلومتر، کره جنوبی با ۷۷۰ کیلومتر و اسپانیا با ۶۶۰ کیلومتر خطوط ریلی شهری، رتبه های یک تا ششم را در این زمینه کسب کرده اند. ایران نیز ۵۵۰ کیلومتر خطوط ریلی شهری دارد و همچنان نیز در این زمینه در حال پیشرفت است.

                    </Typography>



                    <img src={"/assets/images/company/rail/bridge-veresk.png"} style={{width:"90%"}} />
                    <center>پل ورسک نماد راه آهن سراسری کشور
                    </center>



                    <Typography pb={{xs: '8px', md: '16px'}} fontWeight={900} variant={variant}>شركت راه آهن ج.ا.ا:
                    </Typography>
                    <Typography textAlign={'justify'} variant={'subtitle1'} fontWeight={500}
                                lineHeight={'25px'} pb={{xs: '41px', md: '0px'}}>
                        شركت راه آهن ج.ا.ا یکی از شرکت‌های زیر مجموعه وزارت راه و شهرسازی است که وظیفه نگهداری و تعمیر و همچنین بهره‌برداری از شبکه راه‌آهن ایران را برعهده دارد. لازم به ذكر است ساخت و توسعه مسيرهاي ريلي جديد خارج از عهده شركت راه آهن مي‌باشد و بر عهده شرکت مادر تخصصی ساخت و توسعه زیربناهای حمل و نقل کشور مي‌باشد.

                        <br />


                        پس از اصلاحات انجام شده در اوخر دهه 70 و اوايل دهه 80 شمسي، نقش حاكميتي و دولتي اين شركت كاهش يافت و عرصه‌اي براي فعاليت شركت‌هاي خصوصي به وجود آمد. تعمير و نگهداري زيرساخت در حوزه خط و ساز‌ه‌هاي فني، ساختمان و تاسيسات، علائم و ارتباطات، ناوگان، و همچنين حق انتفاع و بهره برداري از واگن‌هاي مسافري و باري و برخي حوضه‌هاي ديگر به بخش خصوص واگذار شده است.

                    </Typography>


                </Grid>
                <Grid display={{xs: 'block', md: 'none'}} pb={{xs: '40px', md: '0px'}}>
                    <img width={'100%'} src={imageMin} alt={''}/>
                </Grid>
                <Grid display={{xs: 'none', md: 'block'}} pb={{xs: '40px', md: '0px'}}>
                    <img src={image} alt={''}/>
                </Grid>

            </Grid>

        </Grid>
    )
}
export default ServicesAltynRail
