import React from 'react'
import {Grid, Typography} from "@mui/material";
import useMediaQuery from "@mui/material/useMediaQuery";
import {useTheme} from "@mui/material/styles";

const ServicesAltynRail = ({image, title, dec, titleItem, items, imageMin}) => {

    // fixme title : string , dec:string , titleItem: string  , items:[]

    const theme = useTheme()

    const isXs = useMediaQuery(theme.breakpoints.down('xs'));
    const isMd = useMediaQuery(theme.breakpoints.up('md'));


    let variant = 'subtitle1';

    let variantSecond = 'subtitle2';

    if (isXs) {
        variant = 'subtitle1';
        variantSecond = 'subtitle2'
    } else if (isMd) {
        variant = 'h2';
        variantSecond = 'subtitle1'
    }


    return (
        <Grid pt={{md: '89px'}}>
            <Grid position={'absolute'} top={{xs:'215%' , xxs:'195%' , s:'142%' , md:'120%' , lg:'90%'}} o right={0} zIndex={-1}>
                <img width={'100%'} src={'assets/images/back.svg'} alt={''}/>

            </Grid>
            <Grid display={'flex'} flexDirection={{xs: 'column', md: 'row-reverse'}}
                  alignItems={{xs: 'center', md: 'start'}}
                  gap={{xs: '0px', md: '25px'}}
                  justifyContent={{xs: 'center', md: 'space-between'}} pb={{xs: '', md: '96px'}}>
                <Grid>
                    <Typography pb={{xs: '8px', md: '16px'}} fontWeight={900} variant={variant}>{title}</Typography>
                    <Typography textAlign={'justify'} variant={'subtitle1'} fontWeight={500}
                                lineHeight={'25px'} pb={{xs: '41px', md: '0px'}}>

                        اهمیت ترخیص کالا از گمرک:

                        <br />


                        ترخیص کالا از گمرک مهم‌ترین فرآیند در زمینه واردات کالا به شمار آمده و همچنین این فرآیند بسته به قوانین و مقررات کشورها قوانین و سلسله مراتب گوناگونی را شامل می‌شود. در خصوص انجام این فرآیند مهم همواره لازم است که با مراحل ترخیص کالا از گمرک آشنا باشید و قوانین و مقررات آن را به خوبی بشناسید، چرا که در صورت بروز هرگونه بی‌دقتی و عدم شناخت کافی از مراحل انجام ترخیص کالا از گمرک، ترخیص کالای شما قاچاق شمرده شده و در نتیجه خسارت‌های مالی و اعتباری زیادی را برای شما به وجود می آورد.

                        <br />

                        شناخت تمام قوانین و مقررات جا به‌ جایی کالاهای وارداتی و یا به عبارتی آشنایی با چگونگی انجام مراحل ترخیص کالا از گمرک می تواند برای هر تاجر و بازرگانی امری مهم و پرفایده باشد؛ اما با توجه به مشغله‌های کاری افراد بهتر آن است که برای انجام تمامی مراحل ترخیص کالا از گمرک این کار را به شرکت‌های فعال در این زمینه بسپارید و همواره برای انجام کارهای مربوط به ترخیص کالای تجارت خود از چنین شرکت‌هایی راهنمایی بگیرید و از تجربیات آن ها در این زمینه بهره‌مند شوید.

                        <br />


                        در واقع شرکت‌هایی که در زمینه ترخیص کالا از گمرک فعالیت دارند، علاوه بر آنکه با تمام قوانین و مراحل انجام این کار آشنا هستند، بارها و بارها این کار را در مرزهای مختلف و در خصوص جا به جایی انواع مختلف کالاها انجام داده اند و در نتیجه تجربه کافی در این زمینه را دارند؛ بنابراین با سپردن فرآیند ترخیص کالاهای تجارت خود به این شرکت ها نه تنها در وقت خود صرفه جویی می‌کنید بلکه از پرداخت هزینه های سنگین و بیهوده نیز جلوگیری به عمل می‌آورید.
                        <br />



                        هلدينگ آلتن از جمله شرکت‌های فعال در این زمینه می‌باشد که شما می توانید از مشاورین و متخصصین این شرکت در زمینه‌ی چگونگی انجام مراحل ترخیص کالا مشورت گرفته و به کمک گروه با تجربه و کاربلد این شرکت به انواع فعالیت‌های تجاری در حوزه بین الملل بپردازید.

                        <br />

                        <strong>آشنایی با مراحل ترخیص کالا از گمرک:
                        </strong>

                        <p>همانطور که گفته شد فرآیند واردات کالا در کشورهای مختلف یک فعالیت مهم اقتصادی است که هر تاجر و بازرگان موفقی باید به خوبی با آن آشنا باشد، چرا که کوچکترین بی دقتی موجب می شود کالای  وارداتی شما کالای قاچاق شناخته شود و لذا پیامدهای ناگواری را برای تجارت شما به دنبال داشته باشد.
                        </p>

                        <p>در واقع مراحل ترخیص کالا از گمرک امری مهم و خطرناک در زمینه تجارت های بین المللی است که باید تاجرین و بازرگانان فعال در حوزه ی بین الملل با قوانین و مقررات مربوط به آن، به خوبی آشنا باشند. شناخت کامل مراحل ترخیص کالا از گمرک موجب می شود که فرآیند جا به جایی کالاها در اسرع وقت و به بهترین شکل ممکن انجام شود. به همین منظور در این بخش از مقاله سعی داریم شما را با مراحل اصلی و مهم از فرآیند ترخیص کالا آشنا نماییم. به طور کلی مراحل ترخیص کالا از گمرک را می توان به صورت زیر دسته بندی نمود:
                        </p>

                        <ul>
                            <li>دریافت پرفرما و پکینگ لیست</li>
                            <li>اخذ مجوز ثبت سفارش بازرگانی
                            </li>
                            <li>بیمه کردن کالا هماهنگی جهت بازرسی در مبداء و مقصد
                            </li>
                            <li>تشکیل پرونده جهت تخصیص ارز و حواله بانکی
                            </li>
                            <li>ارتباط با شرکت حمل و نقل بین المللی
                            </li>
                            <li>دریافت اسناد حمل از شرکت های حمل و نقل بین المللی
                            </li>
                            <li>تکمیل اسناد و تشکیل پرونده
                            </li>
                            <li>تنظیم پیش نویس دور اظهاری
                            </li>
                            <li>بررسی و تایید توسط کارشناس فنی گمرکی و بازرگانی
                            </li>
                            <li>دور اظهاری واردات
                            </li>
                        </ul>



                    </Typography>




                </Grid>
                <Grid display={{xs: 'block', md: 'none'}} pb={{xs: '40px', md: '0px'}}>
                    <img width={'100%'} src={imageMin} alt={''}/>
                </Grid>
                <Grid display={{xs: 'none', md: 'block'}} pb={{xs: '40px', md: '0px'}}>
                    <img src={image} alt={''}/>
                </Grid>

            </Grid>

        </Grid>
    )
}
export default ServicesAltynRail
